---
kind: other
id: Methods.T:Autodesk.Revit.DB.Mechanical.MechanicalEquipmentSet
source: html/c9ec63af-d0fb-5cdd-43e3-498fd39585c2.htm
---
# MechanicalEquipmentSet Methods

Adds member element ids to the mechanical equipment set.